tylertms/kinetis-k22-sim/tests/architecture/cortex_m4/execution/thumb32_extended_test.c
#include "kinetis.h"

#include <stdint.h>

#include "test.h"

static Kinetis* create_device(TestState* state) {
    KinetisConfiguration configuration = kinetis_default_configuration();
    configuration.flash_size = 4096;
    configuration.sram_size = 65536;
    Kinetis* device = kinetis_create(configuration);
    expect(state, device != NULL, "device != NULL");
    const uint32_t vectors[2] = {0x20001000u, 0x00000101u};
    expect(state, kinetis_load(device, 0, vectors, sizeof(vectors)),
           "kinetis_load(device, 0, vectors, sizeof(vectors))");
    return device;
}

static void load_instruction(TestState* state, Kinetis* device, uint16_t first, uint16_t second) {
    const uint16_t program[] = {first, second, 0xbe00u};
    expect(state, kinetis_load(device, 0x100, program, sizeof(program)),
           "kinetis_load(device, 0x100, program, sizeof(program))");
    expect(state, kinetis_reset(device), "kinetis_reset(device)");
    test_connect_debugger(state, kinetis_cpu(device));
}

static void execute(TestState* state, Kinetis* device) {
    const CortexM4Result result = cortex_m4_run(kinetis_cpu(device), (CortexM4RunLimits){2, 10});
    expect(state, result.stop == CORTEX_M4_STOP_BREAKPOINT,
           "result.stop == CORTEX_M4_STOP_BREAKPOINT");
}

int main(void) {
    TestState state = {0};
    Kinetis* device = create_device(&state);
    CortexM4* cpu = kinetis_cpu(device);

    load_instruction(&state, device, 0xfab1u, 0xf081u);
    cortex_m4_set_register(cpu, 1, 0x00001000u);
    execute(&state, device);
    expect(&state, cortex_m4_get_register(cpu, 0) == 19, "cortex_m4_get_register(cpu, 0) == 19");

    load_instruction(&state, device, 0xfa91u, 0xf0a1u);
    cortex_m4_set_register(cpu, 1, 0x80000001u);
    execute(&state, device);
    expect(&state, cortex_m4_get_register(cpu, 0) == 0x80000001u,
           "cortex_m4_get_register(cpu, 0) == 0x80000001u");

    load_instruction(&state, device, 0xf301u, 0x000fu);
    cortex_m4_set_register(cpu, 1, 0x10000u);
    execute(&state, device);
    expect(&state, cortex_m4_get_register(cpu, 0) == 0x7fffu,
           "cortex_m4_get_register(cpu, 0) == 0x7fffu");
    expect(&state, (cortex_m4_get_xpsr(cpu) & (1u << 27)) != 0,
           "(cortex_m4_get_xpsr(cpu) & (1u << 27)) != 0");

    load_instruction(&state, device, 0xf381u, 0x0010u);
    cortex_m4_set_register(cpu, 1, 0xffffffffu);
    execute(&state, device);
    expect(&state, cortex_m4_get_register(cpu, 0) == 0, "cortex_m4_get_register(cpu, 0) == 0");

    load_instruction(&state, device, 0xf361u, 0x200fu);
    cortex_m4_set_register(cpu, 0, 0xffff0000u);
    cortex_m4_set_register(cpu, 1, 0x5au);
    execute(&state, device);
    expect(&state, cortex_m4_get_register(cpu, 0) == 0xffff5a00u,
           "cortex_m4_get_register(cpu, 0) == 0xffff5a00u");

    load_instruction(&state, device, 0xf36fu, 0x02c7u);
    cortex_m4_set_register(cpu, 2, 0xffffffffu);
    execute(&state, device);
    expect(&state, cortex_m4_get_register(cpu, 2) == 0xffffff07u,
           "cortex_m4_get_register(cpu, 2) == 0xffffff07u");

    load_instruction(&state, device, 0xeb14u, 0x045cu);
    cortex_m4_set_register(cpu, 4, 5);
    cortex_m4_set_register(cpu, 12, 8);
    execute(&state, device);
    expect(&state, cortex_m4_get_register(cpu, 4) == 9, "cortex_m4_get_register(cpu, 4) == 9");

    load_instruction(&state, device, 0xeb0du, 0x010eu);
    cortex_m4_set_register(cpu, 14, 4);
    execute(&state, device);
    expect(&state, cortex_m4_get_register(cpu, 1) == 0x20001004u,
           "cortex_m4_get_register(cpu, 1) == 0x20001004u");

    const uint32_t address = 0x20000020u;
    const uint16_t exclusive_program[] = {0xe851u, 0x0f00u, 0xe841u, 0x3200u, 0xbe00u};
    expect(&state, kinetis_load(device, 0x100, exclusive_program, sizeof(exclusive_program)),
           "kinetis_load(device, 0x100, exclusive_program, sizeof(exclusive_program))");
    expect(&state, kinetis_reset(device), "kinetis_reset(device)");
    test_connect_debugger(&state, cpu);
    uint32_t memory = 0x11223344u;
    expect(&state, kinetis_write(device, address, &memory, sizeof(memory)),
           "kinetis_write(device, address, &memory, sizeof(memory))");
    cortex_m4_set_register(cpu, 1, address);
    cortex_m4_set_register(cpu, 3, 0xa55ac33cu);
    CortexM4Result result = cortex_m4_run(cpu, (CortexM4RunLimits){3, 10});
    expect(&state, result.stop == CORTEX_M4_STOP_BREAKPOINT,
           "result.stop == CORTEX_M4_STOP_BREAKPOINT");
    expect(&state, cortex_m4_get_register(cpu, 2) == 0, "cortex_m4_get_register(cpu, 2) == 0");
    expect(&state, kinetis_read(device, address, &memory, sizeof(memory)),
           "kinetis_read(device, address, &memory, sizeof(memory))");
    expect(&state, memory == 0xa55ac33cu, "memory == 0xa55ac33cu");

    const uint8_t table[] = {3, 7, 9};
    expect(&state, kinetis_load(device, 0x200, table, sizeof(table)),
           "kinetis_load(device, 0x200, table, sizeof(table))");
    load_instruction(&state, device, 0xe8d0u, 0xf001u);
    cortex_m4_set_register(cpu, 0, 0x200u);
    cortex_m4_set_register(cpu, 1, 1);
    const CortexM4Result table_result = cortex_m4_step(cpu);
    expect(&state, table_result.stop == CORTEX_M4_STOP_RUNNING,
           "table_result.stop == CORTEX_M4_STOP_RUNNING");
    expect(&state, cortex_m4_get_register(cpu, 15) == 0x112u,
           "cortex_m4_get_register(cpu, 15) == 0x112u");

    kinetis_destroy(device);
    return test_finish(&state);
}
